//конспект занятия
// цикл for
//fun main(){
//    var array = arrayOf(5151,55,97,8,5,355,4,8,44,5,4,1087)
//    for (index in array.indices){
//            print(index)
//            print(":")
//            print(array[index])
//            print(" , ")
//        }
//}

//создаем массив, который хранит индексы своих элементов

//повторять цикл увеличения переменной n на 1, пока (while) переменная n меньше или равна 10 нужно выводить в консоль ее значение.
//fun main(){
//    var n = 1
//    while (n <= 10) {
//        if (n == 10){
//            print(n)
//        } else {
//            print(n)
//            print(",")
//        }
//        n += 1
//    }
//}

//выводим в консоль рандомные числа пока их количество не достигнет девяти
//fun main(){
//    var n = 1
//    while (n < 10){
//        print(Random.nextInt(1000))
//        if (n == 9){
//            print(n)
//        } else {
//            print(n)
//            print(",")
//        }
//        n++
//    }
//}
